config.org
#+TITLE:JTH's Emacs Config
#+AUTHOR: Joshua Travis Horton (JTH)
#+DESCRIPTION: JTH's personal Emacs config developed following DistroTube Configure Emacs Youtube Series in June 2024.
#+STARTUP: showeverything
#+OPTIONS: toc:2

* Table of Content :toc:
- [[#important-programs-to-load-first][IMPORTANT PROGRAMS TO LOAD FIRST]]
  - [[#elpaca-package-manager][Elpaca Package Manager]]
  - [[#load-evil-mode][Load Evil Mode]]
  - [[#general-keybindings][General Keybindings]]
- [[#zooming-inout][Zooming In/Out]]
- [[#buffer-move][Buffer Move]]
- [[#insert-blank-line][Insert Blank Line]]
- [[#graphical-changes][Graphical Changes]]
  - [[#nerd-icons][Nerd Icons]]
  - [[#all-the-icons][ALL-THE-ICONS]]
  - [[#doom-modeline][Doom-Modeline]]
  - [[#dashboard][Dashboard]]
  - [[#diminish][Diminish]]
  - [[#theme][Theme]]
  - [[#font][Font]]
  - [[#rainbow-delimiters][Rainbow Delimiters]]
  - [[#transparency][Transparency]]
  - [[#graphical-user-interface-tweaks][Graphical User Interface Tweaks]]
- [[#sudo-edit][SUDO Edit]]
- [[#which-key][WHICH-KEY]]
- [[#ivy-and-counsel][Ivy and Counsel]]
- [[#company][Company]]
- [[#flycheck][Flycheck]]
- [[#app-launcher][App-Launcher]]
- [[#shells-and-terminals][Shell's and Terminals]]
  - [[#eshell][Eshell]]
- [[#file-managment][File Managment]]
  - [[#backup][BACKUP]]
  - [[#projectile][Projectile]]
  - [[#dired][DIRED]]
  - [[#neotree][Neotree]]
- [[#org-mode][ORG MODE]]
  - [[#org-bullets][ORG Bullets]]
  - [[#org-enable-table-of-contents][ORG Enable Table of Contents]]
  - [[#indetation-behavior][Indetation Behavior]]
  - [[#org-enable-tempo-for-shorthand-completion][ORG Enable Tempo for Shorthand Completion]]

* IMPORTANT PROGRAMS TO LOAD FIRST

** Elpaca Package Manager
Elpaca is a package manager for EMACS allowing for easy importation of add-ons and automatically handle the finle management
#+begin_src emacs-lisp
 (defvar elpaca-installer-version 0.7)
 (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
 (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
 (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
 (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                 :ref nil :depth 1
                                 :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                 :build (:not elpaca--activate-package)))
 (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
     (add-to-list 'load-path (if (file-exists-p build) build repo))
     (unless (file-exists-p repo)
     (make-directory repo t)
     (when (< emacs-major-version 28) (require 'subr-x))
     (condition-case-unless-debug err
         (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                 ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                 ,@(when-let ((depth (plist-get order :depth)))
                                                     (list (format "--depth=%d" depth) "--no-single-branch"))
                                                 ,(plist-get order :repo) ,repo))))
                 ((zerop (call-process "git" nil buffer t "checkout"
                                         (or (plist-get order :ref) "--"))))
                 (emacs (concat invocation-directory invocation-name))
                 ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                         "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                 ((require 'elpaca))
                 ((elpaca-generate-autoloads "elpaca" repo)))
             (progn (message "%s" (buffer-string)) (kill-buffer buffer))
             (error "%s" (with-current-buffer buffer (buffer-string))))
         ((error) (warn "%s" err) (delete-directory repo 'recursive))))
     (unless (require 'elpaca-autoloads nil t)
     (require 'elpaca)
     (elpaca-generate-autoloads "elpaca" repo)
     (load "./elpaca-autoloads")))
 (add-hook 'after-init-hook #'elpaca-process-queues)
 (elpaca `(,@elpaca-order))
#+end_src

** Load Evil Mode
This implement evil mode which is a package to bring VIM like keybindings and behavior to EMACS
#+begin_src emacs-lisp
 ;; Install a package via the elpaca macro
 ;; See the "recipes" section of the manual for more details.
 ;; (elpaca example-package)
 ;; Install use-package support
 (elpaca elpaca-use-package
     ;; Enable use-package :ensure support for Elpaca.
     (elpaca-use-package-mode)
     ;; Assuem :elpaca t unless otherwise specified.
     (setq elpaca-use-package-by-default t))

 ;;When installing a package which modifies a form used at the top-level
 ;;(e.g. a package which adds a use-package key word),
 ;;use the :wait recipe keyword to block until that package has been installed/configured.
 ;;For example:
 ;;(use-package general :ensure (:wait t) :demand t)

 ;; Expands to: (elpaca evil (use-package evil :demand t))
 (use-package evil
     :init ;;tweak evils's config before loading
     (setq evil-want-integration t) ;; optional since it's already true
     (setq evil-want-keybinding nil)
     (setq evil-vsplit-window-right t)
     (setq evil-split-window-below t)
     (setq evil-want-C-i-jump nil) ;;added to enable tab cycling in org mode found via internet search
     (evil-mode))
 (use-package evil-collection
     :after evil
     :config
     (setq evil-collection-mode-list '(dashboard dired ibuffer))
     (evil-collection-init))
 (use-package evil-tutor)

 ;;Turns off elpaca-use-package-mode current declaration
 ;;Note this will cause the declaration to be interpreted immediately (not deferred).
 ;;Useful for configuring built-in emacs features.
 (use-package emacs :ensure nil :config (setq ring-bell-function #'ignore))
#+end_src

