config.org
** General Keybindings
General is a package use to define custom user key bindings. DT uses this feature extensively to create DOOM like behaviors such as using SPC for meta. 
#+begin_src emacs-lisp
 (use-package general
     :config
     (general-evil-setup)

 ;; set up 'SPC' as the global leader key
 (general-create-definer jth/leader-keys
     :states '(normal insert visual emacs)
     :keymaps 'override
     :prefix "SPC" ;; set leader
     :global-prefix "M-SPC") ;; access leader in insert mode

 (jth/leader-keys
     "SPC" '(counsel-M-x :wk "Counsel M-x")
     "." '(find-file :wk "Find file")
     "f c" '((lambda () (interactive) (find-file "~/.config/emacs/config.org")) :wk "Edit emacs config")
     "f r" '(counsel-recentf :wk "Find recent files")
     "TAB TAB" '(comment-line :wk "Comment lines"))

 ;;Changed kill buffer line from DT setup due to error with kill-this-buffer. Pulled lamba function from definition via stackexchange
 (jth/leader-keys
     "b" '(:ignore t :wk "buffer")
     "b b" '(switch-to-buffer :wk "Switch buffer")
     "b i" '(ibuffer :wk "Ibuffer")
     "b k" '(lambda () (interactive) (kill-buffer (current-buffer)) :wk "Kill this buffer")
     "b n" '(next-buffer :wk "Next buffer")
     "b p" '(previous-buffer :wk "Previous buffer")
     "b r" '(revert-buffer :wk "Reload buffer"))

 ;;Keybindings for Dired movement provided by DT setup series
 (jth/leader-keys
     "d" '(:ignore t :wk "Dired")
     "d d" '(dired :wk "Open dired")
     "d j" '(dired-jump :wk "Dired jump to current")
     "d n" '(neotree-dir :wk "Open directory in neotree")
     "d p" '(peep-dired :wk "Peep-dired"))

 ;;Keybindings to evaluate lisp in various options 
 (jth/leader-keys
     "e" '(:ignore t :wk "Evaluate")    
     "e b" '(eval-buffer :wk "Evaluate elisp in buffer")
     "e d" '(eval-defun :wk "Evaluate defun containing or after point")
     "e e" '(eval-expression :wk "Evaluate and elisp expression")
     "e l" '(eval-last-sexp :wk "Evaluate elisp expression before point")
     "e r" '(eval-region :wk "Evaluate elisp in region")) 

 ;;Adding section for all shell key bindings instead of adding to eval.
 (jth/leader-keys
     "s" '(:ignore t :wk "Shell")
     "s e" '(eshell :wk "Load Eshell"))

 ;;Help bindings to define func/var or to "hot reload" emacs config after savings (has issues). Changed config reload to "SPC h r c" for "help reload config" in my mind.
 (jth/leader-keys
     "h" '(:ignore t :wk "Help")
     "h f" '(describe-function :wk "Describe function")
     "h v" '(describe-variable :wk "Describe variable")
     "h r c" '((lambda () (interactive)
       (load-file "~/.config/emacs/init.el")
       (ignore (elpaca-process-queues)))
       :wk "Reload emacs config"))

 ;;Org Mode Keybindings. Put in DT's setup until I develop my own opinions/needs.
 (jth/leader-keys
     "m" '(:ignore t :wk "Org")
     "m a" '(org-agenda :wk "Org agenda")
     "m e" '(org-export-dispatch :wk "Org export dispatch")
     "m i" '(org-toggle-item :wk "Org toggle item")
     "m t" '(org-todo :wk "Org todo")
     "m B" '(org-babel-tangle :wk "Org babel tangle")
     "m T" '(org-todo-list :wk "Org todo list"))

 (jth/leader-keys
     "m b" '(:ignore t :wk "Tables")
     "m b -" '(org-table-insert-hline :wk "Insert hline in table"))

 (jth/leader-keys
     "m d" '(:ignore t :wk "Date/deadline")
     "m d t" '(org-time-stamp :wk "Org time stamp"))

 ;;Projectile keymap added per DT config
 (jth/leader-keys
     "p" '(projectile-command-map :wk "Projectile"))

 ;;Keyboard shortcuts act as toggle for certain functions/items
 (jth/leader-keys
     "t" '(:ignore t :wk "Toggle")
     "t l" '(display-line-numbers-mode :wk "Toggle line numbers")
     "t n" '(neotree-toggle :wk "Toggle neotree file viewer")
     "t t" '(visual-line-mode :wk "Toggle truncated lines")
     "t r" '(rainbow-delimiters-mode :wk "Toggle Rainbow-Delimiters"))

 ;;Keyboard shortcuts to inset blank line above and below using custom functions grabbed from stack exchange. Matche to "o" and "O" for easy of remembering.
 (jth/leader-keys
     "o" '(insert-line-below :wk "Line Below Cursor"))
 (jth/leader-keys
     "O" '(insert-line-above :wk "Line Above Cursor"))

 ;;Keyboard short cuts to act as VIM window controls via defined functions from DT.
 (jth/leader-keys
     "w" '(:ignore t :wk "Windows")
     ;; Window splits
     "w c" '(evil-window-delete :wk "Close window")
     "w n" '(evil-window-new :wk "New window")
     "w s" '(evil-window-split :wk "Horizontal split window")
     "w v" '(evil-window-vsplit :wk "Vertical split window")
     ;; Window motions
     "w h" '(evil-window-left :wk "Window left")
     "w j" '(evil-window-down :wk "Window down")
     "w k" '(evil-window-up :wk "Window up")
     "w l" '(evil-window-right :wk "Window right")
     "w w" '(evil-window-next :wk "Goto next window")
     ;; Move Windows
     "w H" '(buf-move-left :wk "Buffer move left")
     "w J" '(buf-move-down :wk "Buffer move down")
     "w K" '(buf-move-up :wk "Buffer move up")
     "w L" '(buf-move-right :wk "Buffer move right"))
 )
#+end_src

* Zooming In/Out
Adding text-scale-adjust as well as shortcuts on DT's config
#+begin_src emacs-lisp
 (global-set-key (kbd "C-=") 'text-scale-increase)
 (global-set-key (kbd "C--") 'text-scale-decrease)
 (global-set-key (kbd "C-0") 'text-scale-adjust)
 (global-set-key (kbd "<C-wheel-up>") 'text-scale-increase)
 (global-set-key (kbd "<C-wheel-down>") 'text-scale-decrease)
#+end_src


* Buffer Move
This is function found/created by DT to bring VIM window behavior to Emacs. Allowing windows to be swap via key bindings in Gernal section tied to the functiond defined below.
#+begin_src emacs-lisp
 (require 'windmove)

 ;;;###autoload
 (defun buf-move-up ()
   "Swap the current buffer and the buffer above the split.
 If there is no split, ie now window above the current one, an
 error is signaled."
 ;;  "Switches between the current buffer, and the buffer above the
 ;;  split, if possible."
   (interactive)
   (let* ((other-win (windmove-find-other-window 'up))
          (buf-this-buf (window-buffer (selected-window))))
     (if (null other-win)
         (error "No window above this one")
       ;; swap top with this one
       (set-window-buffer (selected-window) (window-buffer other-win))
       ;; move this one to top
       (set-window-buffer other-win buf-this-buf)
       (select-window other-win))))

 ;;;###autoload
 (defun buf-move-down ()
 "Swap the current buffer and the buffer under the split.
 If there is no split, ie now window under the current one, an
 error is signaled."
   (interactive)
   (let* ((other-win (windmove-find-other-window 'down))
          (buf-this-buf (window-buffer (selected-window))))
     (if (or (null other-win) 
             (string-match "^ \\*Minibuf" (buffer-name (window-buffer other-win))))
         (error "No window under this one")
       ;; swap top with this one
       (set-window-buffer (selected-window) (window-buffer other-win))
       ;; move this one to top
       (set-window-buffer other-win buf-this-buf)
       (select-window other-win))))

 ;;;###autoload
 (defun buf-move-left ()
 "Swap the current buffer and the buffer on the left of the split.
 If there is no split, ie now window on the left of the current
 one, an error is signaled."
   (interactive)
   (let* ((other-win (windmove-find-other-window 'left))
          (buf-this-buf (window-buffer (selected-window))))
     (if (null other-win)
         (error "No left split")
       ;; swap top with this one
       (set-window-buffer (selected-window) (window-buffer other-win))
       ;; move this one to top
       (set-window-buffer other-win buf-this-buf)
       (select-window other-win))))

 ;;;###autoload
 (defun buf-move-right ()
 "Swap the current buffer and the buffer on the right of the split.
 If there is no split, ie now window on the right of the current
 one, an error is signaled."
   (interactive)
   (let* ((other-win (windmove-find-other-window 'right))
          (buf-this-buf (window-buffer (selected-window))))
     (if (null other-win)
         (error "No right split")
       ;; swap top with this one
       (set-window-buffer (selected-window) (window-buffer other-win))
       ;; move this one to top
       (set-window-buffer other-win buf-this-buf)
       (select-window other-win))))
#+end_src

