config.org
* Insert Blank Line
#+begin_src emacs-lisp
 (defun insert-line-below ()
   "Insert an empty line below the current line."
   (interactive)
   (save-excursion
     (end-of-line)
     (open-line 1)))

 (defun insert-line-above ()
   "Insert an empty line above the current line."
   (interactive)
   (save-excursion
     (end-of-line 0)
     (open-line 1)))
#+end_src

* Graphical Changes

** Nerd Icons
Requires installation of nerd font/icons to the unit. For linux use the following: cd ~/.local/share/fonts && curl -fLO https://github.com/ryanoasis/nerd-fonts/raw/HEAD/patched-fonts/DroidSansMono/DroidSansMNerdFont-Regular.otf
#+begin_src emacs-lisp
 (use-package nerd-icons
   :ensure (nerd-icons
              :type git
              :host github
              :repo "rainstormstudio/nerd-icons.el"
              :files (:defaults "data"))
 )

 (use-package nerd-icons-dired
   :hook
   (dired-mode . nerd-icons-dired-mode))
#+end_src

** ALL-THE-ICONS
Requires the command M-x all-the-icons-install-fonts to be executed in order for the fonts to be available
All-The-Icons needed for Neotree. Other packages have been moved to Nerd-Icons for now.
#+begin_src emacs-lisp
 (use-package all-the-icons
   :if (display-graphic-p))
#+end_src

** Doom-Modeline
#+begin_src emacs-lisp
 (use-package doom-modeline
     :ensure t
     :init (doom-modeline-mode 1))
#+end_src

** Dashboard
Dashboard setup provided by DT from youtube series on emac config. 
#+begin_src emacs-lisp
 (use-package dashboard
     :ensure t 
     :init
     (setq initial-buffer-choice 'dashboard-open)
     (setq dashboard-set-heading-icons t)
     (setq dashboard-set-file-icons t)
     (setq dashboard-banner-logo-title "Emacs Is More Than A Text Editor!")
     ;;(setq dashboard-startup-banner 'logo) ;; use standard emacs logo as banner
     (setq dashboard-startup-banner "/home/halman/.config/emacs/images/emacs-dash.png")  ;; use custom image as banner
     (setq dashboard-center-content t) ;; set to 't' for centered content
     (setq dashboard-vertically-center-content t)
     (setq dashboard-items '((recents . 5)
                             (agenda . 5 )
                             (bookmarks . 3)
                             (projects . 3)
                             (registers . 3)))
     :custom
     (dashboard-modify-heading-icons '((recents . "file-text")
                                         (bookmarks . "book")))
     :config
     (dashboard-setup-startup-hook))
#+end_src

** Diminish
#+begin_src emacs-lisp
 (use-package diminish :ensure t)
#+end_src

** Theme
This loades in Doom EMACS theme. Excerpt below is from DOOM EMACS github. Custom setup possible but to be looked into at a later date.
#+begin_src emacs-lisp
 ;;Using doom theme with snippet from their github below instead of custom theme to start with.
 (use-package doom-themes
   :ensure t
   :config
 ;; Global settings (defaults)
 (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
     doom-themes-enable-italic t) ; if nil, italics is universally disabled
 (load-theme 'doom-dark+ t)
 ;; Enable flashing mode-line on errors
 (doom-themes-visual-bell-config)
 ;; Enable custom neotree theme (all-the-icons must be installed!)
 (doom-themes-neotree-config)
 ;; or for treemacs users
 (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
 (doom-themes-treemacs-config)
 ;; Corrects (and improves) org-mode's native fontification.
 (doom-themes-org-config))
#+end_src

** Font
This is the recommended font setup from DT and seems to be find at initial review
#+begin_src emacs-lisp
 ;;This requires the installation of JetBrians Font to system. Added to linux via : /bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/JetBrains/JetBrainsMono/master/install_manual.sh)"
 (set-face-attribute 'default nil
     :font "JetBrains Mono"
     :height 110
     :weight 'medium)
 (set-face-attribute 'variable-pitch nil
     :font "Ubuntu"
     :height 120
     :weight 'medium)
 (set-face-attribute 'fixed-pitch nil
     :font "JetBrains Mono"
     :height 110
     :weight 'medium)
 ;; Makes commented text and keywords italics.
 ;; This is working in emacsclient but not emacs.
 ;; Your font must have an italic face available.
 (set-face-attribute 'font-lock-comment-face nil
     :slant 'italic)
 (set-face-attribute 'font-lock-keyword-face nil
     :slant 'italic)

 ;; This sets the default font on all graphical frames created after restarting Emacs.
 ;; Does the same thing as 'set-face-attribute default' above, but emacsclient fonts
 ;; are not right unless I also add this method of setting the default font.
 (add-to-list 'default-frame-alist '(font . "JetBrains Mono-11"))

 ;; Uncomment the following line if line spacing needs adjusting.
 ;;(setq-default line-spacing 0.06)
#+end_src

** Rainbow Delimiters
#+begin_src emacs-lisp
 (use-package rainbow-delimiters)
#+end_src

** Transparency
#+begin_src emacs-lisp
  (set-frame-parameter nil 'alpha-background 92)
  (add-to-list 'default-frame-alist '(alpha-background . 92)) ; For all new frames henceforth
#+end_src

** Graphical User Interface Tweaks

*** Disable Menubar, Toolbar, and Scrollbars
Removes toolbar and other GUI items that are not needed with proper setup/use.
#+begin_src emacs-lisp
 (menu-bar-mode -1)
 (tool-bar-mode -1)
 (scroll-bar-mode -1)
#+end_src

*** Dispay Line Numbers and Truncated Lines
Kept visual line mode true for global but commented out global line numbers. Toggle key binding sufficient if line numbers needed. Looks cleaner this way. 
#+begin_src emacs-lisp
  ;; (global-display-line-numbers-mode 1)
  (global-visual-line-mode t)
#+end_src

* SUDO Edit
#+begin_src emacs-lisp
 (use-package sudo-edit
 :config
 (jth/leader-keys
     "fu" '(sudo-edit-find-file :wk "Sudo find file")
     "fU" '(sudo-edit :wk "Sudo edit file")))
#+end_src

* WHICH-KEY
Allows EMACS to provided info on current control input and suggest completion options based on what is currently known by EMACS 
#+begin_src emacs-lisp
  (use-package which-key
  :init
      (which-key-mode 1)
  :diminish
  :config
  (setq which-key-side-window-location 'right
          which-key-sort-order #'which-key-key-order-alpha
          which-key-sort-uppercase-first nil
          which-key-add-column-padding 0
          which-key-max-display-columns nil
          which-key-min-display-lines 6
          which-key-side-window-slot -10
          which-key-side-window-max-width 0.45
          which-key-idle-delay 0.8
          which-key-max-description-length 25
          which-key-allow-imprecise-window-fit t
          which-key-separator " → " ))
#+end_src

* Ivy and Counsel
#+begin_src emacs-lisp
  (use-package counsel
      :after ivy
      :diminish
      :config (counsel-mode))

  (use-package ivy
      :bind
      ;; ivy-resume resumes the last Ivy-based completion.
      (("C-c C-r" . ivy-resume)
	  ("C-x B" . ivy-switch-buffer-other-window))
      :diminish
      :custom
      (setq ivy-use-virtual-buffers t)
      (setq ivy-count-format "(%d/%d) ")
      (setq enable-recursive-minibuffers t)
      :config
      (ivy-mode))

    (use-package nerd-icons-ivy-rich
	:ensure t
	:init
	(nerd-icons-ivy-rich-mode 1)
	(ivy-rich-mode 1))

    (use-package ivy-rich
	:after ivy
	:ensure t
	:init (ivy-rich-mode 1) ;; this gets us descriptions in M-x.
	:custom
	(ivy-virtual-abbreviate 'full
	ivy-rich-switch-buffer-align-virtual-buffer t
	ivy-rich-path-style 'abbrev)
	:config
	(ivy-set-display-transformer 'ivy-switch-buffer
				      'ivy-rich-switch-buffer-transformer))
#+end_src

* Company
#+begin_src emacs-lisp
  (use-package company
    :defer 2
    :diminish
    :custom
    (company-begin-commands '(self-insert-command))
    (company-idle-delay .1)
    (company-minimum-prefix-length 2)
    (company-show-numbers t)
    (company-tooltip-align-annotations 't)
    (global-company-mode t))

  (use-package company-box
    :after company
    :diminish
    :hook (company-mode . company-box-mode))
#+end_src

* Flycheck
#+begin_src emacs-lisp
  (use-package flycheck
    :ensure t
    :diminish
    :defer t
    :init (global-flycheck-mode))
#+end_src

* App-Launcher
Not adding the app launcher function as it is just outside of my use case I as don't like running emacs as a client right now.
#+begin_src emacs-lisp
  (use-package app-launcher
    :ensure '(app-launcher :host github :repo "SebastienWae/app-launcher"))
#+end_src

* Shell's and Terminals
DT also has vterm loaded but for my purposes I don't think it is worth it at this time. Built into emacs is eshell, shell, and term. Right now eshell seems to be the speed of what I am after without issue of configuring vterm.

