config.org
** Eshell
#+begin_src emacs-lisp
  (use-package eshell-syntax-highlighting
    :after esh-mode
    :config
    (eshell-syntax-highlighting-global-mode +1))

  ;; eshell-syntax-highlighting -- adds fish/zsh-like syntax highlighting.
  ;; eshell-rc-script -- your profile for eshell; like a bashrc for eshell.
  ;; eshell-aliases-file -- sets an aliases file for the eshell.
  
  (setq eshell-rc-script (concat user-emacs-directory "eshell/profile")
        eshell-aliases-file (concat user-emacs-directory "eshell/aliases")
        eshell-history-size 5000
        eshell-buffer-maximum-lines 5000
        eshell-hist-ignoredups t
        eshell-scroll-to-bottom-on-input t
        eshell-destroy-buffer-when-process-dies t
        eshell-visual-commands'("bash" "fish" "htop" "ssh" "top" "zsh"))
#+end_src

* File Managment

** BACKUP
By default, Emacs creates automatic backups of files in their original directories, such “file.el” and the backup “file.el~”.  This leads to a lot of clutter, so let’s tell Emacs to put all backups that it creates in the TRASH directory.
#+begin_src emacs-lisp
    (setq backup-directory-alist '((".*" . "~/.local/share/Trash/files")))
#+end_src

** Projectile
#+begin_src emacs-lisp
 (use-package projectile
   :diminish
   :config
   (projectile-mode 1))
#+end_src

** DIRED
#+begin_src emacs-lisp
 (use-package peep-dired
   :after dired
   :hook (evil-normalize-keymaps . peep-dired-hook)
   :config
     (evil-define-key 'normal dired-mode-map (kbd "h") 'dired-up-directory)
     (evil-define-key 'normal dired-mode-map (kbd "l") 'dired-open-file) ; use dired-find-file instead if not using dired-open package
     (evil-define-key 'normal peep-dired-mode-map (kbd "j") 'peep-dired-next-file)
     (evil-define-key 'normal peep-dired-mode-map (kbd "k") 'peep-dired-prev-file)
 )
#+end_src

** Neotree
#+begin_src emacs-lisp
 (use-package neotree
   :config
   (setq neo-smart-open t
         neo-show-hidden-files t
         neo-window-width 55
         neo-window-fixed-size nil
         inhibit-compacting-font-caches t
         projectile-switch-project-action 'neotree-projectile-action) 
         ;; truncate long file names in neotree
         (add-hook 'neo-after-create-hook
            #'(lambda (_)
                (with-current-buffer (get-buffer neo-buffer-name)
                  (setq truncate-lines t)
                  (setq word-wrap nil)
                  (make-local-variable 'auto-hscroll-mode)
                  (setq auto-hscroll-mode nil)))))
#+end_src

* ORG MODE

** ORG Bullets
Implements good looking bullet rather than asterisks
#+begin_src emacs-lisp
  (add-hook 'org-mode-hook 'org-indent-mode)
  (use-package org-bullets)
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+end_src

** ORG Enable Table of Contents
Allows for creations of Table of contents via ":toc:"
#+begin_src emacs-lisp
  (use-package toc-org
  :commands toc-org-enable
  :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

** Indetation Behavior
Recommended by DT to remove weird behavior with indentation in org mode. Also line for diminishing Org Indent Mode
#+begin_src emacs-lisp
  (electric-indent-mode -1)
  (setq org-edit-src-content-indentation 1)
  (with-eval-after-load 'org-indent
    (require 'diminish)
    (diminish 'org-indent-mode))
#+end_src

** ORG Enable Tempo for Shorthand Completion
Allows for quick inserts of code blocks and etc. Info below:

<a  ’#+BEGIN_EXPORT ascii’ … ‘#+END_EXPORT
<c  ’#+BEGIN_CENTER’ … ‘#+END_CENTER’
<C  ’#+BEGIN_COMMENT’ … ‘#+END_COMMENT’
<e  ’#+BEGIN_EXAMPLE’ … ‘#+END_EXAMPLE’
<E  ’#+BEGIN_EXPORT’ … ‘#+END_EXPORT’
<h  ’#+BEGIN_EXPORT html’ … ‘#+END_EXPORT’
<l  ’#+BEGIN_EXPORT latex’ … ‘#+END_EXPORT’
<q  ’#+BEGIN_QUOTE’ … ‘#+END_QUOTE’
<s  ’#+BEGIN_SRC’ … ‘#+END_SRC’
<v  ’#+BEGIN_VERSE’ … ‘#+END_VERSE’

#+begin_src emacs-lisp
  (require 'org-tempo)
#+end_src
